In [60]:
import pandas as pd
pd.set_option('display.max_columns', None)
pd.set_option('display.max_rows', None)
import re
import sys
sys.path.append('../src')

from support_cleaning import check_nan

In [2]:
moon_phases_ori= pd.read_csv('../data/original/moon_phases.csv')
moon_phases=moon_phases_ori.copy()

In [192]:
moon_phases = moon_phases.rename(columns={'0': 'year'})
moon_phases.head()

   year month day           phase
1  1994     1   1  waning gibbous
2  1994     1   2  waning gibbous
3  1994     1   3  waning gibbous
4  1994     1   4    last quarter
5  1994     1   5    last quarter

In [4]:
moon_phases['month']=moon_phases['1']

In [5]:
moon_phases['day']=moon_phases['1']

In [6]:
moon_phases['phase']=moon_phases['1']

In [7]:
def cleaning_month_phases(x):
    
    if 'Jan' in x:
        return 1
    elif 'Feb' in x:
        return 2
    elif 'Mar' in x:
        return 3
    elif 'Apr' in x:
        return 4
    elif 'May' in x:
        return 5
    elif 'Jun' in x:
        return 6
    elif 'Jul' in x:
        return 7
    elif 'Aug' in x:
        return 8
    elif 'Sep' in x:
        return 9
    elif 'Oct' in x:
        return 10
    elif 'Nov' in x:
        return 11
    elif 'Dec' in x:
        return 12
    else:
        return x

In [8]:
moon_phases['month'] = moon_phases['month'].apply(cleaning_month_phases)

In [9]:
def cleaning_day(x):    
    num = re.findall('\d+', x)
    
    
    if num:
        
        return int(num[0])
    
    else:
        
        return x

In [10]:
moon_phases['day'] = moon_phases['day'].apply(cleaning_day)

In [20]:
def cleaning_phase(x):
    if 'waning gibbous' in x.lower():
        return 'waning gibbous'
    elif 'last quarter' in x.lower():
        return 'last quarter'
    elif 'waning crescent' in x.lower():
        return 'waning crescent'
    elif 'new moon' in x.lower():
        return 'new moon'
    elif 'waxing crescent' in x.lower():
        return 'waxing crescent'
    elif 'first quarter' in x.lower():
        return 'first quarter'
    elif 'waxing gibbous' in x.lower():
        return 'waxing gibbous'
    elif 'full moon' in x.lower():
        return 'full moon'
    else:
        return x

In [12]:
moon_phases['phase'] = moon_phases['phase'].apply(cleaning_phase)

In [13]:
moon_phases = moon_phases.drop('1', axis=1)

In [193]:
moon_phases.head()

   year month day           phase
1  1994     1   1  waning gibbous
2  1994     1   2  waning gibbous
3  1994     1   3  waning gibbous
4  1994     1   4    last quarter
5  1994     1   5    last quarter

In [15]:
to_drop=moon_phases['month'][moon_phases['month']=='Date Moon Phase'].index

In [16]:
to_drop

Int64Index([   0,   32,   61,   93,  124,  156,  187,  219,  251,  282,
            ...
            3456, 3488, 3519, 3551, 3582, 3614, 3646, 3677, 3709, 3740],
           dtype='int64', length=120)

In [17]:
moon_phases=moon_phases.drop(to_drop)

In [19]:
moon_phases.phase.unique()

array(['waning gibbous', 'last quarter', 'waning crescent', 'new moon',
       'waxing crescent', 'first quarter', 'waxing gibbous', 'full moon'],
      dtype=object)

In [21]:
moon_phases.duplicated().any()

False

In [22]:
moon_phases.to_csv("../data/clean/moon_phases_clean.csv", index=False)

In [24]:
eclipses_ori= pd.read_csv('../data/original/eclipses.csv')
eclipses=eclipses_ori.copy()

In [27]:
eclipses=eclipses[['0','2']]

In [31]:
eclipses=eclipses.rename(columns={'0':'fulldate','2':'eclipse'})

In [35]:
to_drop=eclipses['eclipse'][eclipses['eclipse']=='Impact'].index

In [36]:
eclipses=eclipses.drop(to_drop)

In [37]:
eclipses

            fulldate        eclipse
1   Tue May 10, 1994  Solar Eclipse
2   Wed May 25, 1994  Lunar Eclipse
3    Thu Nov 3, 1994  Solar Eclipse
4   Fri Nov 18, 1994  Lunar Eclipse
5   Sat Apr 15, 1995  Lunar Eclipse
6   Sat Apr 29, 1995  Solar Eclipse
7    Sun Oct 8, 1995  Lunar Eclipse
8   Tue Oct 24, 1995  Solar Eclipse
9    Thu Apr 4, 1996  Lunar Eclipse
10  Wed Apr 17, 1996  Solar Eclipse
11  Fri Sep 27, 1996  Lunar Eclipse
12  Sat Oct 12, 1996  Solar Eclipse
13   Sun Mar 9, 1997  Solar Eclipse
14  Mon Mar 24, 1997  Lunar Eclipse
15   Tue Sep 2, 1997  Solar Eclipse
16  Tue Sep 16, 1997  Lunar Eclipse
17  Thu Feb 26, 1998  Solar Eclipse
18  Fri Mar 13, 1998  Lunar Eclipse
19   Sat Aug 8, 1998  Lunar Eclipse
20  Sat Aug 22, 1998  Solar Eclipse
21   Sun Sep 6, 1998  Lunar Eclipse
22  Sun Jan 31, 1999  Lunar Eclipse
23  Tue Feb 16, 1999  Solar Eclipse
24  Wed Jul 28, 1999  Lunar Eclipse
25  Wed Aug 11, 1999  Solar Eclipse
27   Sat Feb 5, 2000  Solar Eclipse
28   Sat Jul 1, 2000  Solar Eclipse
29  Mon Jul 31, 2000  Solar Eclipse
30  Mon Dec 25, 2000  Solar Eclipse
31  Thu Jun 21, 2001  Solar Eclipse
32  Fri Dec 14, 2001  Solar Eclipse
33  Mon Jun 10, 2002  Solar Eclipse
34   Wed Dec 4, 2002  Solar Eclipse
35  Sat May 31, 2003  Solar Eclipse
36  Sun Nov 23, 2003  Solar Eclipse
37  Mon Apr 19, 2004  Solar Eclipse
38  Thu Oct 14, 2004  Solar Eclipse
39   Fri Apr 8, 2005  Solar Eclipse
40   Mon Oct 3, 2005  Solar Eclipse
41  Wed Mar 29, 2006  Solar Eclipse
42  Fri Sep 22, 2006  Solar Eclipse
43  Mon Mar 19, 2007  Solar Eclipse
44  Tue Sep 11, 2007  Solar Eclipse
45   Thu Feb 7, 2008  Solar Eclipse
46   Fri Aug 1, 2008  Solar Eclipse
47  Mon Jan 26, 2009  Solar Eclipse
48  Wed Jul 22, 2009  Solar Eclipse

In [39]:
eclipses['year']=eclipses['fulldate']
eclipses['month']=eclipses['fulldate']
eclipses['day']=eclipses['fulldate']

In [41]:
def cleaning_year_ecl(x):
    num = re.findall('\d+', x)
    
    if num:
        
        return int(num[1])
    
    else:
        
        return x

In [42]:
eclipses['year'] = eclipses['year'].apply(cleaning_year_ecl)

In [48]:
eclipses['month'] = eclipses['month'].apply(cleaning_month)

In [45]:
def cleaning_day_ecl(x):
    num = re.findall('\d+', x)
    
    if num:
        
        return int(num[0])
    
    else:
        
        return x

In [46]:
eclipses['day'] = eclipses['day'].apply(cleaning_day_ecl)

In [51]:
eclipses=eclipses.drop('fulldate', axis=1)

In [55]:
eclipses = eclipses[(eclipses['year'] >= 1994) & (eclipses['year'] <= 2003)]

In [56]:
eclipses

          eclipse  year  month  day
1   Solar Eclipse  1994      5   10
2   Lunar Eclipse  1994      5   25
3   Solar Eclipse  1994     11    3
4   Lunar Eclipse  1994     11   18
5   Lunar Eclipse  1995      4   15
6   Solar Eclipse  1995      4   29
7   Lunar Eclipse  1995     10    8
8   Solar Eclipse  1995     10   24
9   Lunar Eclipse  1996      4    4
10  Solar Eclipse  1996      4   17
11  Lunar Eclipse  1996      9   27
12  Solar Eclipse  1996     10   12
13  Solar Eclipse  1997      3    9
14  Lunar Eclipse  1997      3   24
15  Solar Eclipse  1997      9    2
16  Lunar Eclipse  1997      9   16
17  Solar Eclipse  1998      2   26
18  Lunar Eclipse  1998      3   13
19  Lunar Eclipse  1998      8    8
20  Solar Eclipse  1998      8   22
21  Lunar Eclipse  1998      9    6
22  Lunar Eclipse  1999      1   31
23  Solar Eclipse  1999      2   16
24  Lunar Eclipse  1999      7   28
25  Solar Eclipse  1999      8   11
27  Solar Eclipse  2000      2    5
28  Solar Eclipse  2000      7    1
29  Solar Eclipse  2000      7   31
30  Solar Eclipse  2000     12   25
31  Solar Eclipse  2001      6   21
32  Solar Eclipse  2001     12   14
33  Solar Eclipse  2002      6   10
34  Solar Eclipse  2002     12    4
35  Solar Eclipse  2003      5   31
36  Solar Eclipse  2003     11   23

In [57]:
eclipses.to_csv("../data/clean/eclipses_clean.csv", index=False)

In [109]:
def cleaning_hol_year(x):
    return x.split('-')[0]

In [112]:
def cleaning_hol_month(x):
    return x.split('-')[1]

In [113]:
def cleaning_hol_day(x):
    return x.split('-')[2]

In [178]:
combined_holidays = pd.DataFrame()

years = range(1994, 2004)

for year in years:
    file_path = f'../data/original/public_holidays/publicholiday.US.{year}.csv' 
    
    holidays_data = pd.read_csv(file_path)
    
    combined_holidays = combined_holidays.append(holidays_data, ignore_index=True)

In [194]:
combined_holidays.head()

                       holiday  year  month  day
1  Martin Luther King, Jr. Day  1994      1   17
2        Washington's Birthday  1994      2   21
3                  Good Friday  1994      4    1
4                  Good Friday  1994      4    1
5                 Memorial Day  1994      5   30

In [180]:
combined_holidays=combined_holidays[['Date','Name']]

In [181]:
combined_holidays['year']=combined_holidays['Date']
combined_holidays['month']=combined_holidays['Date']
combined_holidays['day']=combined_holidays['Date']

In [182]:
combined_holidays['year'] = combined_holidays['year'].apply(cleaning_hol_year)
combined_holidays['month'] = combined_holidays['month'].apply(cleaning_hol_month)
combined_holidays['day'] = combined_holidays['day'].apply(cleaning_hol_day)

In [183]:
combined_holidays=combined_holidays.drop('Date', axis=1)

In [184]:
combined_holidays=combined_holidays.rename(columns={'Name':'holiday'})

In [186]:
combined_holidays['year'] = combined_holidays['year'].astype(int)
combined_holidays['month'] = combined_holidays['month'].astype(int)
combined_holidays['day'] = combined_holidays['day'].astype(int)

In [188]:
combined_holidays=combined_holidays[1:]

In [195]:
combined_holidays.head()

                       holiday  year  month  day
1  Martin Luther King, Jr. Day  1994      1   17
2        Washington's Birthday  1994      2   21
3                  Good Friday  1994      4    1
4                  Good Friday  1994      4    1
5                 Memorial Day  1994      5   30

In [189]:
combined_holidays.to_csv('../data/clean/holidays_clean.csv')